archive/before-2018-11-10/2017-07-11-静态动态语言弱类型强类型语言.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-10-01 Mon 21:36 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2017-07-11-静态动态语言弱类型强类型语言</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Peng Xie" />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">2017-07-11-静态动态语言弱类型强类型语言</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orga226312">1. 静态类型和动态类型语言</a></li>
<li><a href="#org5740089">2. 弱类型和强类型语言</a></li>
<li><a href="#org1d9d95b">3. 隐形类型声明和显示类型声明</a></li>
<li><a href="#org024567c">4. 参考资料</a></li>
</ul>
</div>
</div>

<div id="outline-container-orga226312" class="outline-2">
<h2 id="orga226312"><span class="section-number-2">1</span> 静态类型和动态类型语言</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>静态语言
<ol class="org-ol">
<li>每个变量（在编译的时候）就必须绑定到一个类型</li>
<li>每个变量应该绑定到一个对象。不过这个是可选的，如果没有绑定到一
个对象，则认为它是 <code>null</code> 。</li>
<li>一旦变量被绑定到某个类型（被声明了），它就只能被绑定到这个类型
的对象。把它绑定到这个类型之外的对象会抛出异常。</li>
</ol></li>

<li>动态语言
<ol class="org-ol">
<li>每个变量都只能绑定到一个对象。</li>
<li>变量在执行时通过赋值语句被绑定到对象上。</li>
<li>在执行时，也可以把一个变量绑定到不同类型的对象上。</li>
</ol></li>

<li>python是动态类型的语言，java是静态类型的语言</li>
</ul>
</div>
</div>

<div id="outline-container-org5740089" class="outline-2">
<h2 id="org5740089"><span class="section-number-2">2</span> 弱类型和强类型语言</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>弱类型语言
<ol class="org-ol">
<li>变量可以被隐式转换为 <b>不相关</b> 的类型。</li>
<li><p>
大多数语言都允许在 <b>相关地类型</b> 之前进行隐式地类型转换。不相关的
类型比如数字和字符串这两种。在弱类型语言中，下面这几句在弱类型语
言中是可行的：
</p>
<pre class="example">
         a  = 9
         b = "9"
         c = concatenate(a, b)  // produces "99"
         d = add(a, b)          // produces 18
</pre>
<p>
最后两句会分别把a转为字符串，b转为数字。
</p></li>
</ol></li>
<li>强类型语言
<ol class="org-ol">
<li><p>
上面的例子最后两句会抛异常，必须进行隐式类型转换：
</p>
<pre class="example">
         a = 9
         b = "9"
         c = concatenate(  str(a),  b)
         d = add(a,  int(b)  )
</pre></li>
</ol></li>
<li>java和python都是强类型的语言，perl是弱类型的语言</li>
</ul>
</div>
</div>

<div id="outline-container-org1d9d95b" class="outline-2">
<h2 id="org1d9d95b"><span class="section-number-2">3</span> 隐形类型声明和显示类型声明</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>显示类型声明：必须显示地进行类型声明</li>
<li>隐形类型声明：类型声明不是必须的，隐形类型声明使用 <code>type
    inferencing</code> 来决定变量的类型。</li>
</ul>
</div>
</div>

<div id="outline-container-org024567c" class="outline-2">
<h2 id="org024567c"><span class="section-number-2">4</span> 参考资料</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://pythonconquerstheuniverse.wordpress.com/2009/10/03/static-vs-dynamic-typing-of-programming-languages/">Static vs. dynamic typing of programming languages</a>
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Peng Xie</p>
<p class="date">Created: 2018-10-01 Mon 21:36</p>
<p class="validation"></p>
</div>
</body>
</html>